Revit 2027 API
AreaReinforcementType.CreateDefaultAreaReinforcementType Method
 Creates a new AreaReinforcementType object with a default name.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ElementId CreateDefaultAreaReinforcementType(
	Document aDoc
)
Public Shared Function CreateDefaultAreaReinforcementType (
	aDoc As Document
) As ElementId
public:
static ElementId^ CreateDefaultAreaReinforcementType(
	Document^ aDoc
)
static member CreateDefaultAreaReinforcementType :
        aDoc : Document -> ElementId
Parameters
aDoc Document
 The document.
Return Value
ElementId
 The newly created type id.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
AreaReinforcementType Class
Autodesk.Revit.DB.Structure Namespace